︠2f08511d-fdd6-4420-8d76-a9750d760db8︠
%var a1, a2, a3, a4, a6
E = EllipticCurve([a1,a2,a3,a4,a6])
E.c_invariants()
︡5ee493c5-07d3-4fb2-9c85-cdb027403bc8︡{"stdout":"((a1^2 + 4*a2)^2 - 24*a1*a3 - 48*a4, -(a1^2 + 4*a2)^3 + 36*(a1^2 + 4*a2)*(a1*a3 + 2*a4) - 216*a3^2 - 864*a6)\n"}︡
︠1cd47d3e-4722-40b8-9bce-23bef7d683ef︠
E.discriminant()
︡2e18483c-ff92-487f-b63c-7988f1961d90︡{"stdout":"-(a2*a3^2 - a1*a3*a4 + a1^2*a6 - a4^2 + 4*a2*a6)*(a1^2 + 4*a2)^2 - 8*(a1*a3 + 2*a4)^3 + 9*(a1^2 + 4*a2)*(a1*a3 + 2*a4)*(a3^2 + 4*a6) - 27*(a3^2 + 4*a6)^2\n"}︡
︠28ad8435-f48b-4205-b8f5-e413dee268d0︠
E.b_invariants()
︡319b9ce3-8f03-4d7d-b2a5-8e8076df16ac︡{"stdout":"(a1^2 + 4*a2, a1*a3 + 2*a4, a3^2 + 4*a6, a2*a3^2 - a1*a3*a4 + a1^2*a6 - a4^2 + 4*a2*a6)\n"}︡
︠0df48310-abb2-4ba8-aa48-f30a6f01ebac︠
c4, c6 = E.c_invariants()
b2, b4, b6, b8 = E.b_invariants()
︡9a0e1b41-ce2c-4b7d-a428-30d29adb5e84︡
︠5349b270-ac3d-4925-9a5b-5dc07570f775︠
expand((c4^3-c6^2)/1728)
︡62b2cf51-81ad-4866-bc02-25a0da00f991︡{"stdout":"-a1^4*a2*a3^2 + a1^5*a3*a4 - a1^6*a6 - 8*a1^2*a2^2*a3^2 + a1^3*a3^3 + 8*a1^3*a2*a3*a4 + a1^4*a4^2 - 12*a1^4*a2*a6 - 16*a2^3*a3^2 + 36*a1*a2*a3^3 + 16*a1*a2^2*a3*a4 - 30*a1^2*a3^2*a4 + 8*a1^2*a2*a4^2 - 48*a1^2*a2^2*a6 + 36*a1^3*a3*a6 - 27*a3^4 + 72*a2*a3^2*a4 + 16*a2^2*a4^2 - 96*a1*a3*a4^2 - 64*a2^3*a6 + 144*a1*a2*a3*a6 + 72*a1^2*a4*a6 - 64*a4^3 - 216*a3^2*a6 + 288*a2*a4*a6 - 432*a6^2\n"}︡
︠252a9b47-85af-4ab9-9036-8cc47d92fb95︠
expand(-b2**2*b8 - 8*b4**3 - 27*b6**2 + 9*b2*b4*b6) - expand(c4^3-c6^2)/1728
︡0fdb373a-3c94-4f37-8d69-8351178c887b︡{"stdout":"0\n"}︡
︠999789f3-9c19-4453-85ef-23a8ca6c3373︠
b2**2 - 24*b4
c4
︡2f5f28f7-320d-4d09-b3e7-a95ac3a6211e︡{"stdout":"(a1^2 + 4*a2)^2 - 24*a1*a3 - 48*a4\n"}︡{"stdout":"(a1^2 + 4*a2)^2 - 24*a1*a3 - 48*a4\n"}︡
︠3f0e4f71-670f-4165-afe1-d154b2ac280e︠
-b2**3 + 36*b2*b4 - 216*b6
c6
︡590a03bf-190a-449b-bfc1-11d7e7bfb1a5︡{"stdout":"-(a1^2 + 4*a2)^3 + 36*(a1^2 + 4*a2)*(a1*a3 + 2*a4) - 216*a3^2 - 864*a6\n"}︡{"stdout":"-(a1^2 + 4*a2)^3 + 36*(a1^2 + 4*a2)*(a1*a3 + 2*a4) - 216*a3^2 - 864*a6\n"}︡
︠6b727a86-6bc6-4a84-a439-194fda6a90f6︠
%var b2, b4, b6
(c4,c6) = (b2**2 - 24*b4, -b2**3 + 36*b2*b4 - 216*b6)
latex((c4,c6))
︡d3526b2a-9b0f-4d8a-9a46-6552f377e779︡{"stdout":"\\left(b_{2}^{2} - 24 \\, b_{4}, -b_{2}^{3} + 36 \\, b_{2} b_{4} - 216 \\, b_{6}\\right)\n"}︡
︠9bf32473-ff38-4ecc-b053-a0d1fdf20ccf︠
expand((c4^3 - c6^2)/1728)
︡882c4be0-adf5-428f-9303-3075fdbd8635︡{"stdout":"1/4*b2^2*b4^2 - 1/4*b2^3*b6 - 8*b4^3 + 9*b2*b4*b6 - 27*b6^2\n"}︡
︠2fe2e55e-e3bd-4c44-a7d6-73b9c8018384︠
var('b2,b4,b6,b8')
f = -b2**2*b8 - 8*b4**3 - 27*b6**2 + 9*b2*b4*b6
︡280b1a77-4696-4bff-899a-3e0489571596︡{"stdout":"(b2, b4, b6, b8)\n"}︡
︠59b4280e-7a3d-4719-849d-9e02d0f00d18︠
show(f)
︡6f26913b-6c26-4477-82d5-6b7183abbd6f︡{"tex":{"tex":"-8 \\, b_{4}^{3} + 9 \\, b_{2} b_{4} b_{6} - b_{2}^{2} b_{8} - 27 \\, b_{6}^{2}","display":true}}︡
︠91777625-3a77-4a63-9930-b70f9a27b7d2︠
latex(f)
︡0d9bae2b-6209-4174-bbbb-bfce6fe7fe11︡{"stdout":"-8 \\, b_{4}^{3} + 9 \\, b_{2} b_{4} b_{6} - b_{2}^{2} b_{8} - 27 \\, b_{6}^{2}\n"}︡
︠44eea01b-7386-49d5-8761-caa39decf496︠
factor(f)
︡6d7dc5cd-91c5-4c87-8441-34ea2e43d6f2︡{"stdout":"-8*b4^3 + 9*b2*b4*b6 - b2^2*b8 - 27*b6^2"}︡{"stdout":"\n"}︡
︠c7cb5486-f0c0-483c-8e68-39f178306ceb︠
%var a1,a2,a3,a4,a6
v = (a1*a1 + 4*a2, \
                                  a1*a3 + 2*a4, \
                                  a3**2 + 4*a6, \
                                  a1**2 * a6 + 4*a2*a6 - a1*a3*a4 + a2*a3**2 - a4**2)
︡d6a215a7-953d-4338-a39a-4e944cc5125a︡
︠bc2eac52-9c01-4a09-9ea9-2098e539ba14︠
v
︡b8378bfc-5029-43fa-b4bf-3b5bed3fa619︡{"stdout":"(a1^2 + 4*a2, a1*a3 + 2*a4, a3^2 + 4*a6, a2*a3^2 - a1*a3*a4 + a1^2*a6 - a4^2 + 4*a2*a6)\n"}︡
︠fd6682f3-1094-446a-8137-3d50efbb8fd1︠
latex(v)
︡f764bd51-93e5-4672-a41a-e734a2bc69fc︡{"stdout":"\\left(a_{1}^{2} + 4 \\, a_{2}, a_{1} a_{3} + 2 \\, a_{4}, a_{3}^{2} + 4 \\, a_{6}, a_{2} a_{3}^{2} - a_{1} a_{3} a_{4} + a_{1}^{2} a_{6} - a_{4}^{2} + 4 \\, a_{2} a_{6}\\right)\n"}︡
︠e5a086bc-6205-4a89-a046-3f32b76b4b36︠

factor(1728)
︡993bc48a-33d6-4494-a0cb-dbe093bd32ea︡{"stdout":"2^6 * 3^3\n"}︡
︠51360782-9a62-46cb-8a92-7baf1acc22eb︠









